using System;

/*
Вводится два числа. С использованием тернарного оператора определить и вывести на экран максимальное.

Формат входных данных:
5
10

Формат выходных данных:
10
*/

namespace Task07
{
    class MainClass
    {
        public static void Main(string[] args)
        {
            // ввести a, b

            int max = // написать поиск максимуму

            Console.WriteLine(a);
        }
    }
}
