using System;

/*
Вводится три числа. С использованием тернарного оператора определить и вывести на экран максимальное.

Формат входных данных:
5
10
7

Формат выходных данных:
10
*/

namespace Task08
{
    class MainClass
    {
        public static void Main(string[] args)
        {
            // ввести a, b, c

            int max = // описать тернарный оператор

            Console.WriteLine(max);
        }
    }
}
