using System;

/*
Составить программу, вычисляющую заработную плату работника при почасовой оплате A у.е в час.
Значение почасовой оплаты A и количество отработанных часов B вводится с клавиатуры пользователем.
Получаемые от пользователя данные считать корректными. 

Формат входных данных:
10
30

Формат выходных данных:
300
*/

namespace Task03
{
    class MainClass
    {
        public static void Main(string[] args)
        {
            // ввести a, b

            int z = // написать формулу

            Console.WriteLine(z);
        }
    }
}
