using System;

/*
Ввести х и y - координаты точки. Определить четверть координатной плоскости (1, 2, 3 или 4),
которой принадлежит точка. Использовать тернарный оператор.

Формат входных данных:
5
10

Формат выходных данных:
1
*/

namespace Task10
{
    class MainClass
    {
        public static void Main(string[] args)
        {
            // ввести x, y

            int k = // описать тернарный оператор

            Console.WriteLine(k);
        }
    }
}
