using System;

/*
Из двух введенных чисел, одно из которых четное,
а другое нечетное, определить и вывести на экран нечетное число.
Использовать тернарный оператор.

Формат входных данных:
5
10

Формат выходных данных:
5
*/

namespace Task09
{
    class MainClass
    {
        public static void Main(string[] args)
        {
            // ввести a, b

            int n = // описать тернарный оператор

            Console.WriteLine(n);
        }
    }
}
