using System;

/*
Составить программу, вычисляющую значение функции y=2x√(x+√x)
для заданного пользователем с клавиатуры x. Значение y вывести на экран с точностью до
трёх знаков после запятой. Получаемые от пользователя данные считать корректными.


Формат входных данных:
10

Формат выходных данных:
7,256
*/


namespace Task04
{
    class MainClass
    {
        public static void Main(string[] args)
        {
            // ввести х
            double res = // написать формулу
            Console.WriteLine($"{res:f3}");
        }
    }
}
