using System;

/*
Написать программу, вычисляющую скалярное произведение двух векторов в трехмерном пространстве,
заданных своими вещественными координатами.

Формат входных данных:
1
2
3
3
2
1

Формат выходных данных:
10,00
*/

namespace Task06
{
    class MainClass
    {
        public static void Main(string[] args)
        {
            // ввести x1, x2, y1, y2, z1, z2

            double res = // написать формулу

            Console.WriteLine($"{res:f2}");
        }
    }
}
